/*******************************Copyright (c)***********************************
*
*              Copyright (C), 1999-2015, Jointcom . Co., Ltd.
*
*------------------------------------------------------------------------------
* @file	:	implementsetting.cpp
* @author	:mashuai
* @version	:v2.0
* @date		:2015.3.1
* @brief	:
2015.3.6
	改进内容：1、异步连接：减少因某些模块不在线而引起的同步操作超时时间的叠加。
			 2、重连接：针对异常模块，尝试复位模块并重新连接
			 3、开关正常操作过程中不加任何延时

	存在问题：正常连接中，硬件因异常断线，而网络虚电路存在，偶尔无法复位模块。解决办法
			 依次调用DisConnect、Connet函数。		
2015.3.20
	修改内容：
			1、连接时异步连接第一台按设置超时等待，然后每台分别超时等待500ms,最长8秒
			（所有不在线）
			2、增加两个主开关的控制使能
*------------------------------------------------------------------------------*/
#include "StdAfx.h"
#include "implementsetting.h"

namespace ns_com_io_ctl
{
}
